STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215dxx_cm33.h
/*
 * @brief ICACHE unit (ICACHE)
 */
typedef struct
{
  __IO uint32_t CR;              /*!< ICACHE control register                Address offset: 0x000 */
  __IO uint32_t SR;              /*!< ICACHE status register                 Address offset: 0x004 */
  __IO uint32_t IER;             /*!< ICACHE interrupt enable register       Address offset: 0x008 */
  __IO uint32_t FCR;             /*!< ICACHE flag clear register             Address offset: 0x00C */
  __IO uint32_t HMONR;           /*!< ICACHE hit monitor register            Address offset: 0x010 */
  __IO uint32_t MMONR;           /*!< ICACHE miss monitor register           Address offset: 0x014 */
       uint32_t RESERVED0[2];    /*!< Reserved                               Address offset: 0x018-0x01C */
  __IO uint32_t CRR0;            /*!< ICACHE region 0 configuration register Address offset: 0x020 */
  __IO uint32_t CRR1;            /*!< ICACHE region 1 configuration register Address offset: 0x024 */
  __IO uint32_t CRR2;            /*!< ICACHE region 2 configuration register Address offset: 0x028 */
  __IO uint32_t CRR3;            /*!< ICACHE region 3 configuration register Address offset: 0x02C */
       uint32_t RESERVED1[240];  /*!< Reserved                               Address offset: 0x030-0x3EC */
  __IO uint32_t HWCFGR;          /*!< ICACHE hardware configuration register Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< ICACHE version register                Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< ICACHE IP identification register      Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< ICACHE IP size identification register Address offset: 0x3FC */
} ICACHE_TypeDef;

/**
  * @brief Inter-integrated Circuit Interface (I2C)
  */

typedef struct
{
  __IO uint32_t CR1;            /*!< I2C Control register 1                 Address offset: 0x00 */
  __IO uint32_t CR2;            /*!< I2C Control register 2                 Address offset: 0x04 */
  __IO uint32_t OAR1;           /*!< I2C Own address 1 register             Address offset: 0x08 */
  __IO uint32_t OAR2;           /*!< I2C Own address 2 register             Address offset: 0x0C */
  __IO uint32_t TIMINGR;        /*!< I2C Timing register                    Address offset: 0x10 */
  __IO uint32_t TIMEOUTR;       /*!< I2C Timeout register                   Address offset: 0x14 */
  __IO uint32_t ISR;            /*!< I2C Interrupt and status register      Address offset: 0x18 */
  __IO uint32_t ICR;            /*!< I2C Interrupt clear register           Address offset: 0x1C */
  __IO uint32_t PECR;           /*!< I2C PEC register                       Address offset: 0x20 */
  __IO uint32_t RXDR;           /*!< I2C Receive data register              Address offset: 0x24 */
  __IO uint32_t TXDR;           /*!< I2C Transmit data register             Address offset: 0x28 */
  __IO uint32_t AUTOCR;         /*!< I2C Autonomous mode control register   Address offset: 0x2C */
       uint32_t RESERVED[240];  /*!< Reserved                               Address offset: 0x30->0x3EC */
  __IO uint32_t HWCFGR;         /*!< I2C hardware configuration register    Address offset: 0x3F0 */
  __IO uint32_t VERR;           /*!< I2C version register                   Address offset: 0x3F4 */
  __IO uint32_t IPIDR;          /*!< I2C identification register            Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< I2C size identification register       Address offset: 0x3FC */
} I2C_TypeDef;

/**
  * @brief Inter-integrated Circuit Interface (I3C)
  */
typedef struct
{
  __IO uint32_t CR;              /*!< I3C message control register                Address offset: 0x000 */
  __IO uint32_t CFGR;            /*!< I3C configuration register                  Address offset: 0x004 */
       uint32_t RESERVED0[2];    /*!< Reserved                                    Address offset: 0x008-0x00C */
  __IO uint32_t RDR;             /*!< I3C receive data byte register              Address offset: 0x010 */
  __IO uint32_t RDWR;            /*!< I3C receive data word register              Address offset: 0x014 */
  __IO uint32_t TDR;             /*!< I3C transmit data byte register             Address offset: 0x018 */
  __IO uint32_t TDWR;            /*!< I3C transmit data word register             Address offset: 0x01C */
  __IO uint32_t IBIDR;           /*!< I3C IBI payload data register               Address offset: 0x020 */
  __IO uint32_t TGTTDR;          /*!< I3C target transmit configuration register  Address offset: 0x024 */
       uint32_t RESERVED1[2];    /*!< Reserved                                    Address offset: 0x028-0x02C */
  __IO uint32_t SR;              /*!< I3C status register                         Address offset: 0x030 */
  __IO uint32_t SER;             /*!< I3C status error register                   Address offset: 0x034 */
       uint32_t RESERVED2[2];    /*!< Reserved                                    Address offset: 0x038-0x03C */
  __IO uint32_t RMR;             /*!< I3C received message register               Address offset: 0x040 */
       uint32_t RESERVED3[3];    /*!< Reserved                                    Address offset: 0x044-0x04C */
  __IO uint32_t EVR;             /*!< I3C event register                          Address offset: 0x050 */
  __IO uint32_t IER;             /*!< I3C interrupt enable register               Address offset: 0x054 */
  __IO uint32_t CEVR;            /*!< I3C clear event register                    Address offset: 0x058 */
  __IO uint32_t MISR;            /*!< I3C masked interrupt status register        Address offset: 0x05C */
  __IO uint32_t DEVR0;           /*!< I3C own device characteristics register     Address offset: 0x060 */
  __IO uint32_t DEVRX[4];        /*!< I3C device x (0<=x<=4) register             Address offset: 0x064-0x070 */
       uint32_t RESERVED4[7];    /*!< Reserved                                    Address offset: 0x074-0x08C */
  __IO uint32_t MAXRLR;          /*!< I3C maximum read length register            Address offset: 0x090 */
  __IO uint32_t MAXWLR;          /*!< I3C maximum write length register           Address offset: 0x094 */
       uint32_t RESERVED5[2];    /*!< Reserved                                    Address offset: 0x098-0x09C */
  __IO uint32_t TIMINGR0;        /*!< I3C timing register 0                       Address offset: 0x0A0 */
  __IO uint32_t TIMINGR1;        /*!< I3C timing register 1                       Address offset: 0x0A4 */
  __IO uint32_t TIMINGR2;        /*!< I3C timing register 2                       Address offset: 0x0A8 */
       uint32_t RESERVED6[5];    /*!< Reserved                                    Address offset: 0x0AC-0x0BC */
  __IO uint32_t BCR;             /*!< I3C bus characteristics register            Address offset: 0x0C0 */
  __IO uint32_t DCR;             /*!< I3C device characteristics register         Address offset: 0x0C4 */
  __IO uint32_t GETCAPR;         /*!< I3C get capability register                 Address offset: 0x0C8 */
  __IO uint32_t CRCAPR;          /*!< I3C controller-role capability register     Address offset: 0x0CC */
  __IO uint32_t GETMXDSR;        /*!< I3C get capability register                 Address offset: 0x0D0 */
  __IO uint32_t EPIDR;           /*!< I3C extended provisioned ID register        Address offset: 0x0D4 */
       uint32_t RESERVED7[198];  /*!< Reserved                                    Address offset: 0x0D8-0x3EC */
  __IO uint32_t HWCFGR;          /*!< I3C hardware configuration register         Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< I3C version register                        Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< I3C IP identification register              Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< I3C IP size identification register         Address offset: 0x3FC */
} I3C_TypeDef;

