STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215dxx_cm33.h
/*
 * @brief Window Watchdog (WWDG)
 */
typedef struct
{
  __IO uint32_t CR;              /*!< Control register                     Address offset: 0x000 */
  __IO uint32_t CFR;             /*!< Configuration register               Address offset: 0x004 */
  __IO uint32_t SR;              /*!< Status register                      Address offset: 0x008 */
       uint32_t RESERVED0[249];  /*!< Reserved                             Address offset: 0x00C-0x3EC */
  __IO uint32_t HWCFGR;          /*!< WWDG hardware configuration register Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< WWDG version register                Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< WWDG ID register                     Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< WWDG size ID register                Address offset: 0x3FC */
} WWDG_TypeDef;

/**
  * @}
  */

/**
 * @}
 */

/** @addtogroup Peripheral_declaration
  * @{
  */
/**
 * @brief stm32mp2 base addresses Definitions :
 */
#define PERIPH_SIZE                         (0x10000000UL)  /*!< Size of : AHB/APB Peripherals                                  */

#define SRAMS_SIZE                          (0x10000000UL)  /*!< Size of : SRAMs memory region                                  */

#define SYSRAM_SIZE                         ( 256UL *1024UL) /*!< Unit is Byte                                                   */
#define SRAM1_SIZE                          ( 64UL *1024UL) /*!< Unit is Byte                                                   */
#define NPURAM_SIZE                         ( 128UL *1024UL) /*!< Unit is Byte                                                   */
#define RETRAM_SIZE                         ( 128UL *1024UL) /*!< Unit is Byte                                                   */
#define BKP_SRAM_SIZE                       (   8UL *1024UL) /*!< Unit is Byte                                                   */
#define CAN_SRAM_SIZE                       (  10UL *1024UL) /*!< Unit is Byte                                                   */
#define DDR_SIZE                            (1536UL * 1024UL * 1024UL) /*!< Unit is Byte                                       */

#define MPU_AXI_BUS_MEMORY_BASE             (0x50000000UL) /*!< Base address of : AXI Bus                                       */

#define OSPI1_MEM_BASE                      (MPU_AXI_BUS_MEMORY_BASE + 0x10000000UL) /*!< Base address of : OSPI1 memory  accessible over AXI    */
#define FMC_NOR_MEM_BASE                    (MPU_AXI_BUS_MEMORY_BASE + 0x20000000UL) /*!< Base address of : FMC NOR memories  accessible over AXI */
#define DDR_MEM_BASE                        (MPU_AXI_BUS_MEMORY_BASE + 0x30000000UL) /*!< Base address of : DDR (DRAM) over AXI                   */

#define SRAMS_FETCH_SIZE                    (0x02000000UL)        /*!< Size of : SRAMs memory region for CM33 instruction fetch */

/*!< Peripherals Non secure aliases */
#define PERIPH_BASE_NS                      (0x40000000UL)        /*!< Base address of : AHB/APB Peripherals                    */

/*!< Memories Non secure aliases */
#define SRAMS_BASE_NS                       (0x20000000UL)        /*!< Base address of : SRAMs region                           */

#define SYSRAM_BASE_NS                      (SRAMS_BASE_NS + 0x00000000UL)  /*!< Base address of : System RAM accessible over AXI         */
#define RETRAM_BASE_NS                      (SRAMS_BASE_NS + 0x00040000UL)  /*!< Base address of : Retention RAM                          */
#define SRAM1_BASE_NS                       (SRAMS_BASE_NS + 0x00060000UL)  /*!< Base address of : static data RAM1                       */
#define NPURAM_BASE_NS                      (SRAMS_BASE_NS + 0x000A0000UL)  /*!< Base address of : VIDEO ENCODE/DECODE static RAM         */

#define CAN_SRAM_BASE_NS                    (0x40310000UL)        /*!< Base address of : CAN static  RAM                        */
#define BKP_SRAM_BASE_NS                    (0x42000000UL)        /*!< Base address of : backup static  RAM                     */

#define SRAMS_FETCH_BASE_NS                 (0x0A000000UL)        /*!< Base address of : SRAMs region for CM33 instruction fetch*/

/*!< Peripherals buses Non secure aliases */
#define APB1_PERIPH_BASE_NS                 (PERIPH_BASE_NS + 0x00000000UL)
#define APB2_PERIPH_BASE_NS                 (PERIPH_BASE_NS + 0x00200000UL)
#define AHB2_PERIPH_BASE_NS                 (PERIPH_BASE_NS + 0x00400000UL)
#define AHB3_PERIPH_BASE_NS                 (PERIPH_BASE_NS + 0x02000000UL)
#define APB3_PERIPH_BASE_NS                 (PERIPH_BASE_NS + 0x04000000UL)
#define AHB4_PERIPH_BASE_NS                 (PERIPH_BASE_NS + 0x04200000UL)
#define SMART_RUN_APB_PERIPH_BASE_NS        (PERIPH_BASE_NS + 0x06000000UL)
#define SMART_RUN_AHB_PERIPH_BASE_NS        (PERIPH_BASE_NS + 0x06200000UL)
#define APB4_PERIPH_BASE_NS                 (PERIPH_BASE_NS + 0x08000000UL)
#define AHB5_PERIPH_BASE_NS                 (PERIPH_BASE_NS + 0x08200000UL)
#define APB_DEBUG_PERIPH_BASE_NS            (PERIPH_BASE_NS + 0x0A000000UL)
#define AHB6_PERIPH_BASE_NS                 (PERIPH_BASE_NS + 0x0B000000UL)

/*!< APB1 peripherals Non secure aliases */
#define TIM2_BASE_NS                        (APB1_PERIPH_BASE_NS + 0x000000UL)
#define TIM3_BASE_NS                        (APB1_PERIPH_BASE_NS + 0x010000UL)
#define TIM4_BASE_NS                        (APB1_PERIPH_BASE_NS + 0x020000UL)
#define TIM5_BASE_NS                        (APB1_PERIPH_BASE_NS + 0x030000UL)
#define TIM6_BASE_NS                        (APB1_PERIPH_BASE_NS + 0x040000UL)
#define TIM7_BASE_NS                        (APB1_PERIPH_BASE_NS + 0x050000UL)
#define TIM12_BASE_NS                       (APB1_PERIPH_BASE_NS + 0x060000UL)
#define TIM13_BASE_NS                       (APB1_PERIPH_BASE_NS + 0x070000UL)
#define TIM14_BASE_NS                       (APB1_PERIPH_BASE_NS + 0x080000UL)
#define LPTIM1_BASE_NS                      (APB1_PERIPH_BASE_NS + 0x090000UL)
#define LPTIM2_BASE_NS                      (APB1_PERIPH_BASE_NS + 0x0A0000UL)
#define SPI2_BASE_NS                        (APB1_PERIPH_BASE_NS + 0x0B0000UL)
#define SPI3_BASE_NS                        (APB1_PERIPH_BASE_NS + 0x0C0000UL)
#define SPDIFRX_BASE_NS                     (APB1_PERIPH_BASE_NS + 0x0D0000UL)
#define USART2_BASE_NS                      (APB1_PERIPH_BASE_NS + 0x0E0000UL)
#define USART3_BASE_NS                      (APB1_PERIPH_BASE_NS + 0x0F0000UL)
#define UART4_BASE_NS                       (APB1_PERIPH_BASE_NS + 0x100000UL)
#define UART5_BASE_NS                       (APB1_PERIPH_BASE_NS + 0x110000UL)
#define I2C1_BASE_NS                        (APB1_PERIPH_BASE_NS + 0x170000UL)
#define I2C2_BASE_NS                        (APB1_PERIPH_BASE_NS + 0x180000UL)
#define I3C1_BASE_NS                        (APB1_PERIPH_BASE_NS + 0x190000UL)
#define I3C2_BASE_NS                        (APB1_PERIPH_BASE_NS + 0x1A0000UL)
#define TIM10_BASE_NS                       (APB1_PERIPH_BASE_NS + 0x1C0000UL)
#define TIM11_BASE_NS                       (APB1_PERIPH_BASE_NS + 0x1D0000UL)

/*!< APB2 peripherals Non secure aliases */
#define TIM1_BASE_NS                        (APB2_PERIPH_BASE_NS + 0x000000UL)
#define TIM8_BASE_NS                        (APB2_PERIPH_BASE_NS + 0x010000UL)
#define USART6_BASE_NS                      (APB2_PERIPH_BASE_NS + 0x020000UL)
#define SPI1_BASE_NS                        (APB2_PERIPH_BASE_NS + 0x030000UL)
#define SPI4_BASE_NS                        (APB2_PERIPH_BASE_NS + 0x040000UL)
#define TIM15_BASE_NS                       (APB2_PERIPH_BASE_NS + 0x050000UL)
#define TIM16_BASE_NS                       (APB2_PERIPH_BASE_NS + 0x060000UL)
#define TIM17_BASE_NS                       (APB2_PERIPH_BASE_NS + 0x070000UL)
#define SPI5_BASE_NS                        (APB2_PERIPH_BASE_NS + 0x080000UL)
#define SAI1_BASE_NS                        (APB2_PERIPH_BASE_NS + 0x090000UL)
#define SAI1_Block_A_BASE_NS                (SAI1_BASE_NS + 0x004UL)
#define SAI1_Block_B_BASE_NS                (SAI1_BASE_NS + 0x024UL)
#define SAI2_BASE_NS                        (APB2_PERIPH_BASE_NS + 0x0A0000UL)
#define SAI2_Block_A_BASE_NS                (SAI2_BASE_NS + 0x004UL)
#define SAI2_Block_B_BASE_NS                (SAI2_BASE_NS + 0x024UL)
#define SAI3_BASE_NS                        (APB2_PERIPH_BASE_NS + 0x0B0000UL)
#define SAI3_Block_A_BASE_NS                (SAI3_BASE_NS + 0x004UL)
#define SAI3_Block_B_BASE_NS                (SAI3_BASE_NS + 0x024UL)
#define FDCAN1_BASE_NS                      (APB2_PERIPH_BASE_NS + 0x0D0000UL)
#define FDCAN2_BASE_NS                      (APB2_PERIPH_BASE_NS + 0x0E0000UL)
#define CANCU_BASE_NS                       (APB2_PERIPH_BASE_NS + 0x100000UL)
#define CANSRAM_BASE_NS                     (APB2_PERIPH_BASE_NS + 0x110000UL)
#define USART1_BASE_NS                      (APB2_PERIPH_BASE_NS + 0x130000UL)
#define SAI4_BASE_NS                        (APB2_PERIPH_BASE_NS + 0x140000UL)
#define SAI4_Block_A_BASE_NS                (SAI4_BASE_NS + 0x004UL)
#define SAI4_Block_B_BASE_NS                (SAI4_BASE_NS + 0x024UL)
#define UART7_BASE_NS                       (APB2_PERIPH_BASE_NS + 0x170000UL)

/*!< AHB2 peripherals Non secure aliases */
#define HPDMA1_BASE_NS                      (AHB2_PERIPH_BASE_NS + 0x000000UL)
#define HPDMA2_BASE_NS                      (AHB2_PERIPH_BASE_NS + 0x010000UL)
#define HPDMA3_BASE_NS                      (AHB2_PERIPH_BASE_NS + 0x020000UL)
#define OCTOSPI1_BASE_NS                    (AHB2_PERIPH_BASE_NS + 0x030000UL)
#define ICACHE_BASE_NS                      (AHB2_PERIPH_BASE_NS + 0x070000UL)
#define DCACHE_BASE_NS                      (AHB2_PERIPH_BASE_NS + 0x080000UL)
#define IPCC1_BASE_NS                       (AHB2_PERIPH_BASE_NS + 0x090000UL)
#define IPCC1_C1_BASE_NS                    (IPCC1_BASE_NS)
#define IPCC1_C2_BASE_NS                    (IPCC1_BASE_NS + 0x10UL)
#define DCMI_BASE_NS                        (AHB2_PERIPH_BASE_NS + 0x0A0000UL)
#define PSSI_BASE_NS                        (AHB2_PERIPH_BASE_NS + 0x0B0000UL)
#define CRC_BASE_NS                         (AHB2_PERIPH_BASE_NS + 0x0C0000UL)
#define MDF1_BASE_NS                        (AHB2_PERIPH_BASE_NS + 0x0D0000UL)
#define MDF1_Filter0_BASE_NS                (MDF1_BASE_NS + 0x80UL)
#define MDF1_Filter1_BASE_NS                (MDF1_BASE_NS + 0x100UL)
#define MDF1_Filter2_BASE_NS                (MDF1_BASE_NS + 0x180UL)
#define MDF1_Filter3_BASE_NS                (MDF1_BASE_NS + 0x200UL)
#define MDF1_Filter4_BASE_NS                (MDF1_BASE_NS + 0x280UL)
#define MDF1_Filter5_BASE_NS                (MDF1_BASE_NS + 0x300UL)
#define MDF1_Filter6_BASE_NS                (MDF1_BASE_NS + 0x380UL)
#define MDF1_Filter7_BASE_NS                (MDF1_BASE_NS + 0x400UL)
#define ADC1_BASE_NS                        (AHB2_PERIPH_BASE_NS + 0x0E0000UL)
#define ADC1_COMMON_BASE_NS                 (AHB2_PERIPH_BASE_NS + 0x0E0300UL)
#define ADC2_BASE_NS                        (AHB2_PERIPH_BASE_NS + 0x0F0000UL)
#define ADC2_COMMON_BASE_NS                 (AHB2_PERIPH_BASE_NS + 0x0F0300UL)

#define HPDMA1_Channel0_BASE_NS             (HPDMA1_BASE_NS + 0x0050UL)
#define HPDMA1_Channel1_BASE_NS             (HPDMA1_BASE_NS + 0x00D0UL)
#define HPDMA1_Channel2_BASE_NS             (HPDMA1_BASE_NS + 0x0150UL)
#define HPDMA1_Channel3_BASE_NS             (HPDMA1_BASE_NS + 0x01D0UL)
#define HPDMA1_Channel4_BASE_NS             (HPDMA1_BASE_NS + 0x0250UL)
#define HPDMA1_Channel5_BASE_NS             (HPDMA1_BASE_NS + 0x02D0UL)
#define HPDMA1_Channel6_BASE_NS             (HPDMA1_BASE_NS + 0x0350UL)
#define HPDMA1_Channel7_BASE_NS             (HPDMA1_BASE_NS + 0x03D0UL)
#define HPDMA1_Channel8_BASE_NS             (HPDMA1_BASE_NS + 0x0450UL)
#define HPDMA1_Channel9_BASE_NS             (HPDMA1_BASE_NS + 0x04D0UL)
#define HPDMA1_Channel10_BASE_NS            (HPDMA1_BASE_NS + 0x0550UL)
#define HPDMA1_Channel11_BASE_NS            (HPDMA1_BASE_NS + 0x05D0UL)
#define HPDMA1_Channel12_BASE_NS            (HPDMA1_BASE_NS + 0x0650UL)
#define HPDMA1_Channel13_BASE_NS            (HPDMA1_BASE_NS + 0x06D0UL)
#define HPDMA1_Channel14_BASE_NS            (HPDMA1_BASE_NS + 0x0750UL)
#define HPDMA1_Channel15_BASE_NS            (HPDMA1_BASE_NS + 0x07D0UL)

#define HPDMA2_Channel0_BASE_NS             (HPDMA2_BASE_NS + 0x0050UL)
#define HPDMA2_Channel1_BASE_NS             (HPDMA2_BASE_NS + 0x00D0UL)
#define HPDMA2_Channel2_BASE_NS             (HPDMA2_BASE_NS + 0x0150UL)
#define HPDMA2_Channel3_BASE_NS             (HPDMA2_BASE_NS + 0x01D0UL)
#define HPDMA2_Channel4_BASE_NS             (HPDMA2_BASE_NS + 0x0250UL)
#define HPDMA2_Channel5_BASE_NS             (HPDMA2_BASE_NS + 0x02D0UL)
#define HPDMA2_Channel6_BASE_NS             (HPDMA2_BASE_NS + 0x0350UL)
#define HPDMA2_Channel7_BASE_NS             (HPDMA2_BASE_NS + 0x03D0UL)
#define HPDMA2_Channel8_BASE_NS             (HPDMA2_BASE_NS + 0x0450UL)
#define HPDMA2_Channel9_BASE_NS             (HPDMA2_BASE_NS + 0x04D0UL)
#define HPDMA2_Channel10_BASE_NS            (HPDMA2_BASE_NS + 0x0550UL)
#define HPDMA2_Channel11_BASE_NS            (HPDMA2_BASE_NS + 0x05D0UL)
#define HPDMA2_Channel12_BASE_NS            (HPDMA2_BASE_NS + 0x0650UL)
#define HPDMA2_Channel13_BASE_NS            (HPDMA2_BASE_NS + 0x06D0UL)
#define HPDMA2_Channel14_BASE_NS            (HPDMA2_BASE_NS + 0x0750UL)
#define HPDMA2_Channel15_BASE_NS            (HPDMA2_BASE_NS + 0x07D0UL)

#define HPDMA3_Channel0_BASE_NS             (HPDMA3_BASE_NS + 0x0050UL)
#define HPDMA3_Channel1_BASE_NS             (HPDMA3_BASE_NS + 0x00D0UL)
#define HPDMA3_Channel2_BASE_NS             (HPDMA3_BASE_NS + 0x0150UL)
#define HPDMA3_Channel3_BASE_NS             (HPDMA3_BASE_NS + 0x01D0UL)
#define HPDMA3_Channel4_BASE_NS             (HPDMA3_BASE_NS + 0x0250UL)
#define HPDMA3_Channel5_BASE_NS             (HPDMA3_BASE_NS + 0x02D0UL)
#define HPDMA3_Channel6_BASE_NS             (HPDMA3_BASE_NS + 0x0350UL)
#define HPDMA3_Channel7_BASE_NS             (HPDMA3_BASE_NS + 0x03D0UL)
#define HPDMA3_Channel8_BASE_NS             (HPDMA3_BASE_NS + 0x0450UL)
#define HPDMA3_Channel9_BASE_NS             (HPDMA3_BASE_NS + 0x04D0UL)
#define HPDMA3_Channel10_BASE_NS            (HPDMA3_BASE_NS + 0x0550UL)
#define HPDMA3_Channel11_BASE_NS            (HPDMA3_BASE_NS + 0x05D0UL)
#define HPDMA3_Channel12_BASE_NS            (HPDMA3_BASE_NS + 0x0650UL)
#define HPDMA3_Channel13_BASE_NS            (HPDMA3_BASE_NS + 0x06D0UL)
#define HPDMA3_Channel14_BASE_NS            (HPDMA3_BASE_NS + 0x0750UL)
#define HPDMA3_Channel15_BASE_NS            (HPDMA3_BASE_NS + 0x07D0UL)

/*!< AHB3 peripherals Non secure aliases */
#define HASH2_BASE_NS                       (AHB3_PERIPH_BASE_NS + 0x010000UL)
#define HASH2_DIGEST_BASE_NS                (HASH2_BASE_NS + 0x310UL)
#define RNG2_BASE_NS                        (AHB3_PERIPH_BASE_NS + 0x020000UL)
#define HASH1_BASE_NS                       (AHB3_PERIPH_BASE_NS + 0x030400UL)
#define HASH1_DIGEST_BASE_NS                (HASH1_BASE_NS + 0x310UL)
#define RNG1_BASE_NS                        (AHB3_PERIPH_BASE_NS + 0x030800UL)
#define RAMCFG_BASE_NS                      (AHB3_PERIPH_BASE_NS + 0x070000UL)
#define RAMCFG_SYSRAM_BASE_NS               (RAMCFG_BASE_NS)
#define RAMCFG_SRAM1_BASE_NS                (RAMCFG_BASE_NS + 0x000080UL)
#define RAMCFG_SRAM2_BASE_NS                (RAMCFG_BASE_NS + 0x000100UL)
#define RAMCFG_RETRAM_BASE_NS               (RAMCFG_BASE_NS + 0x000180UL)
#define RAMCFG_BKPSRAM_BASE_NS              (RAMCFG_BASE_NS + 0x000380UL)
#define RIFSC_BASE_NS                       (AHB3_PERIPH_BASE_NS + 0x080000UL)
#define RISC_BASE_NS                        (RIFSC_BASE_NS)
#define RIMC_BASE_NS                        (RIFSC_BASE_NS + 0xC00UL)
#define RIFSC_ID_BASE_NS                    (RIFSC_BASE_NS + 0xFB0UL)
#define IAC_BASE_NS                         (AHB3_PERIPH_BASE_NS + 0x090000UL)
#define RISAF1_BASE_NS                      (AHB3_PERIPH_BASE_NS + 0x0A0000UL)
#define RISAF2_BASE_NS                      (AHB3_PERIPH_BASE_NS + 0x0B0000UL)
#define RISAF4_BASE_NS                      (AHB3_PERIPH_BASE_NS + 0x0D0000UL)
#define RISAB1_BASE_NS                      (AHB3_PERIPH_BASE_NS + 0x0F0000UL)
#define RISAB2_BASE_NS                      (AHB3_PERIPH_BASE_NS + 0x100000UL)
#define RISAB3_BASE_NS                      (AHB3_PERIPH_BASE_NS + 0x110000UL)
#define RISAB5_BASE_NS                      (AHB3_PERIPH_BASE_NS + 0x130000UL)

/*!< APB3 peripherals Non secure aliases */
#define BSEC_BASE_NS                        (APB3_PERIPH_BASE_NS + 0x000000UL)
#define IWDG1_BASE_NS                       (APB3_PERIPH_BASE_NS + 0x010000UL)
#define IWDG2_BASE_NS                       (APB3_PERIPH_BASE_NS + 0x020000UL)
#define IWDG3_BASE_NS                       (APB3_PERIPH_BASE_NS + 0x030000UL)
#define IWDG4_BASE_NS                       (APB3_PERIPH_BASE_NS + 0x040000UL)
#define WWDG1_BASE_NS                       (APB3_PERIPH_BASE_NS + 0x050000UL)
#define VREFBUF_BASE_NS                     (APB3_PERIPH_BASE_NS + 0x060000UL)
#define DTS_BASE_NS                         (APB3_PERIPH_BASE_NS + 0x070000UL)
#define SERC_BASE_NS                        (APB3_PERIPH_BASE_NS + 0x080000UL)
#define HDP_BASE_NS                         (APB3_PERIPH_BASE_NS + 0x090000UL)
#define DBGMCU_BASE_NS                      (APB3_PERIPH_BASE_NS + 0x0A0000UL)
/*!< AHB4 peripherals Non secure aliases */
#define RCC_BASE_NS                         (AHB4_PERIPH_BASE_NS + 0x00000UL)
#define PWR_BASE_NS                         (AHB4_PERIPH_BASE_NS + 0x10000UL)
#define EXTI1_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x20000UL)
#define EXTI1_C1_BASE_NS                    (EXTI1_BASE_NS + 0x80UL)
#define EXTI1_C2_BASE_NS                    (EXTI1_BASE_NS + 0xC0UL)
#define EXTI1_C3_BASE_NS                    (EXTI1_BASE_NS + 0x100UL)
#define SYSCFG_BASE_NS                      (AHB4_PERIPH_BASE_NS + 0x30000UL)
#define GPIOA_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x40000UL)
#define GPIOB_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x50000UL)
#define GPIOC_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x60000UL)
#define GPIOD_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x70000UL)
#define GPIOE_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x80000UL)
#define GPIOF_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0x90000UL)
#define GPIOG_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0xA0000UL)
#define GPIOH_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0xB0000UL)
#define GPIOI_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0xC0000UL)
#define EXTI2_BASE_NS                       (AHB4_PERIPH_BASE_NS + 0xD0000UL)
#define EXTI2_C1_BASE_NS                    (EXTI2_BASE_NS + 0x80UL)
#define EXTI2_C2_BASE_NS                    (EXTI2_BASE_NS + 0xC0UL)
#define EXTI2_C3_BASE_NS                    (EXTI2_BASE_NS + 0x100UL)

