STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215dxx_cm33.h
/*****************  Bit definition for IPCC_HWCFGR register  ******************/
#define IPCC_HWCFGR_CHANNELS_Pos      (0U)
#define IPCC_HWCFGR_CHANNELS_Msk      (0xFFUL << IPCC_HWCFGR_CHANNELS_Pos)     /*!< 0x000000FF */
#define IPCC_HWCFGR_CHANNELS          IPCC_HWCFGR_CHANNELS_Msk                /*!< Number of channels per CPU supported by the IP, range 1 to 16 */
#define IPCC_HWCFGR_SECCTRL_Pos       (8U)
#define IPCC_HWCFGR_SECCTRL_Msk       (0xFUL << IPCC_HWCFGR_SECCTRL_Pos)       /*!< 0x00000F00 */
#define IPCC_HWCFGR_SECCTRL           IPCC_HWCFGR_SECCTRL_Msk                 /*!< security options, range 1 to 16 */
#define IPCC_HWCFGR_OPTBITS_Pos       (16U)
#define IPCC_HWCFGR_OPTBITS_Msk       (0xFFUL << IPCC_HWCFGR_OPTBITS_Pos)      /*!< 0x00FF0000 */
#define IPCC_HWCFGR_OPTBITS           IPCC_HWCFGR_OPTBITS_Msk                 /*!< reserved for future use */
#define IPCC_HWCFGR_CIDWIDTH_Pos      (24U)
#define IPCC_HWCFGR_CIDWIDTH_Msk      (0xFUL << IPCC_HWCFGR_CIDWIDTH_Pos)      /*!< 0x0F000000 */
#define IPCC_HWCFGR_CIDWIDTH          IPCC_HWCFGR_CIDWIDTH_Msk                /*!< CID bit filed width range 0 to 12 */

/******************  Bit definition for IPCC_VERR register  *******************/
#define IPCC_VERR_MINREV_Pos          (0U)
#define IPCC_VERR_MINREV_Msk          (0xFUL << IPCC_VERR_MINREV_Pos)          /*!< 0x0000000F */
#define IPCC_VERR_MINREV              IPCC_VERR_MINREV_Msk                    /*!< IP Minor Revision number */
#define IPCC_VERR_MAJREV_Pos          (4U)
#define IPCC_VERR_MAJREV_Msk          (0xFUL << IPCC_VERR_MAJREV_Pos)          /*!< 0x000000F0 */
#define IPCC_VERR_MAJREV              IPCC_VERR_MAJREV_Msk                    /*!< IP Major Revision number */

/******************  Bit definition for IPCC_IPIDR register  ******************/
#define IPCC_IPIDR_IPID_Pos           (0U)
#define IPCC_IPIDR_IPID_Msk           (0xFFFFFFFFUL << IPCC_IPIDR_IPID_Pos)    /*!< 0xFFFFFFFF */
#define IPCC_IPIDR_IPID               IPCC_IPIDR_IPID_Msk                     /*!< IP identification */

/******************  Bit definition for IPCC_SIDR register  *******************/
#define IPCC_SIDR_SID_Pos             (0U)
#define IPCC_SIDR_SID_Msk             (0xFFFFFFFFUL << IPCC_SIDR_SID_Pos)      /*!< 0xFFFFFFFF */
#define IPCC_SIDR_SID                 IPCC_SIDR_SID_Msk                       /*!< IP size identification */

/**********************  Bit definition for IPCC_C1CR register  ***************/
#define IPCC_CR_RXOIE_Pos         IPCC_C1CR_RXOIE_Pos
#define IPCC_CR_RXOIE_Msk         IPCC_C1CR_RXOIE_Msk
#define IPCC_CR_RXOIE             IPCC_C1CR_RXOIE
#define IPCC_CR_SECRXOIE_Pos      IPCC_C1CR_SECRXOIE_Pos
#define IPCC_CR_SECRXOIE_Msk      IPCC_C1CR_SECRXOIE_Msk
#define IPCC_CR_SECRXOIE          IPCC_C1CR_SECRXOIE
#define IPCC_CR_TXFIE_Pos         IPCC_C1CR_TXFIE_Pos
#define IPCC_CR_TXFIE_Msk         IPCC_C1CR_TXFIE_Msk
#define IPCC_CR_TXFIE             IPCC_C1CR_TXFIE
#define IPCC_CR_SECTXFIE_Pos      IPCC_C1CR_SECTXFIE_Pos
#define IPCC_CR_SECTXFIE_Msk      IPCC_C1CR_SECTXFIE_Msk
#define IPCC_CR_SECTXFIE          IPCC_C1CR_SECTXFIE

/**********************  Bit definition for IPCC_C1MR register  **************/
#define IPCC_MR_CH1OM_Pos         IPCC_C1MR_CH1OM_Pos
#define IPCC_MR_CH1OM_Msk         IPCC_C1MR_CH1OM_Msk
#define IPCC_MR_CH1OM             IPCC_C1MR_CH1OM
#define IPCC_MR_CH2OM_Pos         IPCC_C1MR_CH2OM_Pos
#define IPCC_MR_CH2OM_Msk         IPCC_C1MR_CH2OM_Msk
#define IPCC_MR_CH2OM             IPCC_C1MR_CH2OM
#define IPCC_MR_CH3OM_Pos         IPCC_C1MR_CH3OM_Pos
#define IPCC_MR_CH3OM_Msk         IPCC_C1MR_CH3OM_Msk
#define IPCC_MR_CH3OM             IPCC_C1MR_CH3OM
#define IPCC_MR_CH4OM_Pos         IPCC_C1MR_CH4OM_Pos
#define IPCC_MR_CH4OM_Msk         IPCC_C1MR_CH4OM_Msk
#define IPCC_MR_CH4OM             IPCC_C1MR_CH4OM
#define IPCC_MR_CH5OM_Pos         IPCC_C1MR_CH5OM_Pos
#define IPCC_MR_CH5OM_Msk         IPCC_C1MR_CH5OM_Msk
#define IPCC_MR_CH5OM             IPCC_C1MR_CH5OM
#define IPCC_MR_CH6OM_Pos         IPCC_C1MR_CH6OM_Pos
#define IPCC_MR_CH6OM_Msk         IPCC_C1MR_CH6OM_Msk
#define IPCC_MR_CH6OM             IPCC_C1MR_CH6OM
#define IPCC_MR_CH7OM_Pos         IPCC_C1MR_CH7OM_Pos
#define IPCC_MR_CH7OM_Msk         IPCC_C1MR_CH7OM_Msk
#define IPCC_MR_CH7OM             IPCC_C1MR_CH7OM
#define IPCC_MR_CH8OM_Pos         IPCC_C1MR_CH8OM_Pos
#define IPCC_MR_CH8OM_Msk         IPCC_C1MR_CH8OM_Msk
#define IPCC_MR_CH8OM             IPCC_C1MR_CH8OM
#define IPCC_MR_CH9OM_Pos         IPCC_C1MR_CH9OM_Pos
#define IPCC_MR_CH9OM_Msk         IPCC_C1MR_CH9OM_Msk
#define IPCC_MR_CH9OM             IPCC_C1MR_CH9OM
#define IPCC_MR_CH10OM_Pos        IPCC_C1MR_CH10OM_Pos
#define IPCC_MR_CH10OM_Msk        IPCC_C1MR_CH10OM_Msk
#define IPCC_MR_CH10OM            IPCC_C1MR_CH10OM
#define IPCC_MR_CH11OM_Pos        IPCC_C1MR_CH11OM_Pos
#define IPCC_MR_CH11OM_Msk        IPCC_C1MR_CH11OM_Msk
#define IPCC_MR_CH11OM            IPCC_C1MR_CH11OM
#define IPCC_MR_CH12OM_Pos        IPCC_C1MR_CH12OM_Pos
#define IPCC_MR_CH12OM_Msk        IPCC_C1MR_CH12OM_Msk
#define IPCC_MR_CH12OM            IPCC_C1MR_CH12OM
#define IPCC_MR_CH13OM_Pos        IPCC_C1MR_CH13OM_Pos
#define IPCC_MR_CH13OM_Msk        IPCC_C1MR_CH13OM_Msk
#define IPCC_MR_CH13OM            IPCC_C1MR_CH13OM
#define IPCC_MR_CH14OM_Pos        IPCC_C1MR_CH14OM_Pos
#define IPCC_MR_CH14OM_Msk        IPCC_C1MR_CH14OM_Msk
#define IPCC_MR_CH14OM            IPCC_C1MR_CH14OM
#define IPCC_MR_CH15OM_Pos        IPCC_C1MR_CH15OM_Pos
#define IPCC_MR_CH15OM_Msk        IPCC_C1MR_CH15OM_Msk
#define IPCC_MR_CH15OM            IPCC_C1MR_CH15OM
#define IPCC_MR_CH16OM_Pos        IPCC_C1MR_CH16OM_Pos
#define IPCC_MR_CH16OM_Msk        IPCC_C1MR_CH16OM_Msk
#define IPCC_MR_CH16OM            IPCC_C1MR_CH16OM

#define IPCC_MR_CH1FM_Pos         IPCC_C1MR_CH1FM_Pos
#define IPCC_MR_CH1FM_Msk         IPCC_C1MR_CH1FM_Msk
#define IPCC_MR_CH1FM             IPCC_C1MR_CH1FM
#define IPCC_MR_CH2FM_Pos         IPCC_C1MR_CH2FM_Pos
#define IPCC_MR_CH2FM_Msk         IPCC_C1MR_CH2FM_Msk
#define IPCC_MR_CH2FM             IPCC_C1MR_CH2FM
#define IPCC_MR_CH3FM_Pos         IPCC_C1MR_CH3FM_Pos
#define IPCC_MR_CH3FM_Msk         IPCC_C1MR_CH3FM_Msk
#define IPCC_MR_CH3FM             IPCC_C1MR_CH3FM
#define IPCC_MR_CH4FM_Pos         IPCC_C1MR_CH4FM_Pos
#define IPCC_MR_CH4FM_Msk         IPCC_C1MR_CH4FM_Msk
#define IPCC_MR_CH4FM             IPCC_C1MR_CH4FM
#define IPCC_MR_CH5FM_Pos         IPCC_C1MR_CH5FM_Pos
#define IPCC_MR_CH5FM_Msk         IPCC_C1MR_CH5FM_Msk
#define IPCC_MR_CH5FM             IPCC_C1MR_CH5FM
#define IPCC_MR_CH6FM_Pos         IPCC_C1MR_CH6FM_Pos
#define IPCC_MR_CH6FM_Msk         IPCC_C1MR_CH6FM_Msk
#define IPCC_MR_CH6FM             IPCC_C1MR_CH6FM
#define IPCC_MR_CH7FM_Pos         IPCC_C1MR_CH7FM_Pos
#define IPCC_MR_CH7FM_Msk         IPCC_C1MR_CH7FM_Msk
#define IPCC_MR_CH7FM             IPCC_C1MR_CH7FM
#define IPCC_MR_CH8FM_Pos         IPCC_C1MR_CH8FM_Pos
#define IPCC_MR_CH8FM_Msk         IPCC_C1MR_CH8FM_Msk
#define IPCC_MR_CH8FM             IPCC_C1MR_CH8FM
#define IPCC_MR_CH9FM_Pos         IPCC_C1MR_CH9FM_Pos
#define IPCC_MR_CH9FM_Msk         IPCC_C1MR_CH9FM_Msk
#define IPCC_MR_CH9FM             IPCC_C1MR_CH9FM
#define IPCC_MR_CH10FM_Pos        IPCC_C1MR_CH10FM_Pos
#define IPCC_MR_CH10FM_Msk        IPCC_C1MR_CH10FM_Msk
#define IPCC_MR_CH10FM            IPCC_C1MR_CH10FM
#define IPCC_MR_CH11FM_Pos        IPCC_C1MR_CH11FM_Pos
#define IPCC_MR_CH11FM_Msk        IPCC_C1MR_CH11FM_Msk
#define IPCC_MR_CH11FM            IPCC_C1MR_CH11FM
#define IPCC_MR_CH12FM_Pos        IPCC_C1MR_CH12FM_Pos
#define IPCC_MR_CH12FM_Msk        IPCC_C1MR_CH12FM_Msk
#define IPCC_MR_CH12FM            IPCC_C1MR_CH12FM
#define IPCC_MR_CH13FM_Pos        IPCC_C1MR_CH13FM_Pos
#define IPCC_MR_CH13FM_Msk        IPCC_C1MR_CH13FM_Msk
#define IPCC_MR_CH13FM            IPCC_C1MR_CH13FM
#define IPCC_MR_CH14FM_Pos        IPCC_C1MR_CH14FM_Pos
#define IPCC_MR_CH14FM_Msk        IPCC_C1MR_CH14FM_Msk
#define IPCC_MR_CH14FM            IPCC_C1MR_CH14FM
#define IPCC_MR_CH15FM_Pos        IPCC_C1MR_CH15FM_Pos
#define IPCC_MR_CH15FM_Msk        IPCC_C1MR_CH15FM_Msk
#define IPCC_MR_CH15FM            IPCC_C1MR_CH15FM
#define IPCC_MR_CH16FM_Pos        IPCC_C1MR_CH16FM_Pos
#define IPCC_MR_CH16FM_Msk        IPCC_C1MR_CH16FM_Msk
#define IPCC_MR_CH16FM            IPCC_C1MR_CH16FM

/**********************  Bit definition for IPCC_C1SCR register  ***************/
#define IPCC_SCR_CH1C_Pos         IPCC_C1SCR_CH1C_Pos
#define IPCC_SCR_CH1C_Msk         IPCC_C1SCR_CH1C_Msk
#define IPCC_SCR_CH1C             IPCC_C1SCR_CH1C
#define IPCC_SCR_CH2C_Pos         IPCC_C1SCR_CH2C_Pos
#define IPCC_SCR_CH2C_Msk         IPCC_C1SCR_CH2C_Msk
#define IPCC_SCR_CH2C             IPCC_C1SCR_CH2C
#define IPCC_SCR_CH3C_Pos         IPCC_C1SCR_CH3C_Pos
#define IPCC_SCR_CH3C_Msk         IPCC_C1SCR_CH3C_Msk
#define IPCC_SCR_CH3C             IPCC_C1SCR_CH3C
#define IPCC_SCR_CH4C_Pos         IPCC_C1SCR_CH4C_Pos
#define IPCC_SCR_CH4C_Msk         IPCC_C1SCR_CH4C_Msk
#define IPCC_SCR_CH4C             IPCC_C1SCR_CH4C
#define IPCC_SCR_CH5C_Pos         IPCC_C1SCR_CH5C_Pos
#define IPCC_SCR_CH5C_Msk         IPCC_C1SCR_CH5C_Msk
#define IPCC_SCR_CH5C             IPCC_C1SCR_CH5C
#define IPCC_SCR_CH6C_Pos         IPCC_C1SCR_CH6C_Pos
#define IPCC_SCR_CH6C_Msk         IPCC_C1SCR_CH6C_Msk
#define IPCC_SCR_CH6C             IPCC_C1SCR_CH6C
#define IPCC_SCR_CH7C_Pos         IPCC_C1SCR_CH7C_Pos
#define IPCC_SCR_CH7C_Msk         IPCC_C1SCR_CH7C_Msk
#define IPCC_SCR_CH7C             IPCC_C1SCR_CH7C
#define IPCC_SCR_CH8C_Pos         IPCC_C1SCR_CH8C_Pos
#define IPCC_SCR_CH8C_Msk         IPCC_C1SCR_CH8C_Msk
#define IPCC_SCR_CH8C             IPCC_C1SCR_CH8C
#define IPCC_SCR_CH9C_Pos         IPCC_C1SCR_CH9C_Pos
#define IPCC_SCR_CH9C_Msk         IPCC_C1SCR_CH9C_Msk
#define IPCC_SCR_CH9C             IPCC_C1SCR_CH9C
#define IPCC_SCR_CH10C_Pos        IPCC_C1SCR_CH10C_Pos
#define IPCC_SCR_CH10C_Msk        IPCC_C1SCR_CH10C_Msk
#define IPCC_SCR_CH10C            IPCC_C1SCR_CH10C
#define IPCC_SCR_CH11C_Pos        IPCC_C1SCR_CH11C_Pos
#define IPCC_SCR_CH11C_Msk        IPCC_C1SCR_CH11C_Msk
#define IPCC_SCR_CH11C            IPCC_C1SCR_CH11C
#define IPCC_SCR_CH12C_Pos        IPCC_C1SCR_CH12C_Pos
#define IPCC_SCR_CH12C_Msk        IPCC_C1SCR_CH12C_Msk
#define IPCC_SCR_CH12C            IPCC_C1SCR_CH12C
#define IPCC_SCR_CH13C_Pos        IPCC_C1SCR_CH13C_Pos
#define IPCC_SCR_CH13C_Msk        IPCC_C1SCR_CH13C_Msk
#define IPCC_SCR_CH13C            IPCC_C1SCR_CH13C
#define IPCC_SCR_CH14C_Pos        IPCC_C1SCR_CH14C_Pos
#define IPCC_SCR_CH14C_Msk        IPCC_C1SCR_CH14C_Msk
#define IPCC_SCR_CH14C            IPCC_C1SCR_CH14C
#define IPCC_SCR_CH15C_Pos        IPCC_C1SCR_CH15C_Pos
#define IPCC_SCR_CH15C_Msk        IPCC_C1SCR_CH15C_Msk
#define IPCC_SCR_CH15C            IPCC_C1SCR_CH15C
#define IPCC_SCR_CH16C_Pos        IPCC_C1SCR_CH16C_Pos
#define IPCC_SCR_CH16C_Msk        IPCC_C1SCR_CH16C_Msk
#define IPCC_SCR_CH16C            IPCC_C1SCR_CH16C

