STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215dxx_cm33.h
/* Bit fields for PWR_WIO5SEMCR register */
#define PWR_WIO5SEMCR_SEM_MUTEX_Pos            (0U)
#define PWR_WIO5SEMCR_SEM_MUTEX_Msk            (0x1UL << PWR_WIO5SEMCR_SEM_MUTEX_Pos)
#define PWR_WIO5SEMCR_SEM_MUTEX                PWR_WIO5SEMCR_SEM_MUTEX_Msk  /*!< Semaphore mutexApplication can set semaphore bit to get exclusive access to Wakeup IO x when SEM_EN is set in PWR_WIOxCIDCFGR (writes are ignored otherwise).Read 0: Semaphore is free to takeRead 1: Semaphore is takenWrite 0: Release semaphoreWrite 1: Acquire semaphoreWhen SEM_MUTEX=0 only applications belonging to white-listed compartments (defined with SEMWLCy bits in PWR_WIOxCIDCFGR) can acquire this semaphore.When SEM_MUTEX=1 only applications belonging to compartment SEMCID can release this semaphore.This bit is cleared when CFEN or SEM_EN are cleared from 1 in PWR_WIOxCIDCFGR. */
#define PWR_WIO5SEMCR_SEMCID_Pos               (4U)
#define PWR_WIO5SEMCR_SEMCID_Msk               (0x7UL << PWR_WIO5SEMCR_SEMCID_Pos)
#define PWR_WIO5SEMCR_SEMCID                   PWR_WIO5SEMCR_SEMCID_Msk  /*!< Semaphore Current Compartment IDWhen SEM_EN=1, this read-only bit field is updated with the CID value of the latest successfulacquisition of PWR_WIOxSEMCR semaphore (SEM_MUTEX bit set to 1). */

/* Bit fields for PWR_WIO6CIDCFGR register */
#define PWR_WIO6CIDCFGR_CFEN_Pos               (0U)
#define PWR_WIO6CIDCFGR_CFEN_Msk               (0x1UL << PWR_WIO6CIDCFGR_CFEN_Pos)
#define PWR_WIO6CIDCFGR_CFEN                   PWR_WIO6CIDCFGR_CFEN_Msk  /*!< Compartment ID filter enable- 0: Compartment-based filtering is disabled for Wakeup IO x.- 1: Compartment-based filtering is enabled for Wakeup IO x. */
#define PWR_WIO6CIDCFGR_SEM_EN_Pos             (1U)
#define PWR_WIO6CIDCFGR_SEM_EN_Msk             (0x1UL << PWR_WIO6CIDCFGR_SEM_EN_Pos)
#define PWR_WIO6CIDCFGR_SEM_EN                 PWR_WIO6CIDCFGR_SEM_EN_Msk  /*!< Semaphore enable- 0: Access to Wakeup IO x is granted only if CID of the access equals to SCID.- 1: Access to Wakeup IO x is granted only if SEM_MUTEX=1 and CID of the access equals to SEMCID.This bit is ignored if CFEN=0. When this bit is cleared from 1 SEM_MUTEX is cleared. */
#define PWR_WIO6CIDCFGR_SCID_Pos               (4U)
#define PWR_WIO6CIDCFGR_SCID_Msk               (0x7UL << PWR_WIO6CIDCFGR_SCID_Pos)
#define PWR_WIO6CIDCFGR_SCID                   PWR_WIO6CIDCFGR_SCID_Msk  /*!< Static compartment identifierTrusted domain application uses this bitfield to statically define which compartment has accessto the peripheral x when SEM_EN=0.This bit field is ignored if SEM_EN=1 or CFEN=0. */
#define PWR_WIO6CIDCFGR_SEMWLC0_Pos            (16U)
#define PWR_WIO6CIDCFGR_SEMWLC0_Msk            (0x1UL << PWR_WIO6CIDCFGR_SEMWLC0_Pos)
#define PWR_WIO6CIDCFGR_SEMWLC0                PWR_WIO6CIDCFGR_SEMWLC0_Msk  /*!< Semaphore compartment ID 0 enable- 0: The Compartment ID 0 agent is disabled to take the semaphore- 1: The Compartment ID 0 agent is enabled to take the semaphore */
#define PWR_WIO6CIDCFGR_SEMWLC1_Pos            (17U)
#define PWR_WIO6CIDCFGR_SEMWLC1_Msk            (0x1UL << PWR_WIO6CIDCFGR_SEMWLC1_Pos)
#define PWR_WIO6CIDCFGR_SEMWLC1                PWR_WIO6CIDCFGR_SEMWLC1_Msk  /*!< Semaphore compartment ID 1 enable- 0: The Compartment ID 1 agent is disabled to take the semaphore- 1: The Compartment ID 1 agent is enabled to take the semaphore */
#define PWR_WIO6CIDCFGR_SEMWLC2_Pos            (18U)
#define PWR_WIO6CIDCFGR_SEMWLC2_Msk            (0x1UL << PWR_WIO6CIDCFGR_SEMWLC2_Pos)
#define PWR_WIO6CIDCFGR_SEMWLC2                PWR_WIO6CIDCFGR_SEMWLC2_Msk  /*!< Semaphore compartment ID 2 enable- 0: The Compartment ID 2 agent is disabled to take the semaphore- 1: The Compartment ID 2 agent is enabled to take the semaphore */
#define PWR_WIO6CIDCFGR_SEMWLC3_Pos            (19U)
#define PWR_WIO6CIDCFGR_SEMWLC3_Msk            (0x1UL << PWR_WIO6CIDCFGR_SEMWLC3_Pos)
#define PWR_WIO6CIDCFGR_SEMWLC3                PWR_WIO6CIDCFGR_SEMWLC3_Msk  /*!< Semaphore compartment ID 3 enable- 0: The Compartment ID 3 agent is disabled to take the semaphore- 1: The Compartment ID 3 agent is enabled to take the semaphore */
#define PWR_WIO6CIDCFGR_SEMWLC4_Pos            (20U)
#define PWR_WIO6CIDCFGR_SEMWLC4_Msk            (0x1UL << PWR_WIO6CIDCFGR_SEMWLC4_Pos)
#define PWR_WIO6CIDCFGR_SEMWLC4                PWR_WIO6CIDCFGR_SEMWLC4_Msk  /*!< Semaphore compartment ID 4 enable- 0: The Compartment ID 4 agent is disabled to take the semaphore- 1: The Compartment ID 4 agent is enabled to take the semaphore */
#define PWR_WIO6CIDCFGR_SEMWLC5_Pos            (21U)
#define PWR_WIO6CIDCFGR_SEMWLC5_Msk            (0x1UL << PWR_WIO6CIDCFGR_SEMWLC5_Pos)
#define PWR_WIO6CIDCFGR_SEMWLC5                PWR_WIO6CIDCFGR_SEMWLC5_Msk  /*!< Semaphore compartment ID 5 enable- 0: The Compartment ID 5 agent is disabled to take the semaphore- 1: The Compartment ID 5 agent is enabled to take the semaphore */
#define PWR_WIO6CIDCFGR_SEMWLC6_Pos            (22U)
#define PWR_WIO6CIDCFGR_SEMWLC6_Msk            (0x1UL << PWR_WIO6CIDCFGR_SEMWLC6_Pos)
#define PWR_WIO6CIDCFGR_SEMWLC6                PWR_WIO6CIDCFGR_SEMWLC6_Msk  /*!< Semaphore compartment ID 6 enable- 0: The Compartment ID 6 agent is disabled to take the semaphore- 1: The Compartment ID 6 agent is enabled to take the semaphore */
#define PWR_WIO6CIDCFGR_SEMWLC7_Pos            (23U)
#define PWR_WIO6CIDCFGR_SEMWLC7_Msk            (0x1UL << PWR_WIO6CIDCFGR_SEMWLC7_Pos)
#define PWR_WIO6CIDCFGR_SEMWLC7                PWR_WIO6CIDCFGR_SEMWLC7_Msk  /*!< Semaphore Compartment ID 7 enable- 0: The Compartment ID 7 agent is disabled to take the semaphore- 1: The Compartment ID 7 agent is enabled to take the semaphore */

/* Bit fields for PWR_WIO6SEMCR register */
#define PWR_WIO6SEMCR_SEM_MUTEX_Pos            (0U)
#define PWR_WIO6SEMCR_SEM_MUTEX_Msk            (0x1UL << PWR_WIO6SEMCR_SEM_MUTEX_Pos)
#define PWR_WIO6SEMCR_SEM_MUTEX                PWR_WIO6SEMCR_SEM_MUTEX_Msk  /*!< Semaphore mutexApplication can set semaphore bit to get exclusive access to Wakeup IO x when SEM_EN is set in PWR_WIOxCIDCFGR (writes are ignored otherwise).Read 0: Semaphore is free to takeRead 1: Semaphore is takenWrite 0: Release semaphoreWrite 1: Acquire semaphoreWhen SEM_MUTEX=0 only applications belonging to white-listed compartments (defined with SEMWLCy bits in PWR_WIOxCIDCFGR) can acquire this semaphore.When SEM_MUTEX=1 only applications belonging to compartment SEMCID can release this semaphore.This bit is cleared when CFEN or SEM_EN are cleared from 1 in PWR_WIOxCIDCFGR. */
#define PWR_WIO6SEMCR_SEMCID_Pos               (4U)
#define PWR_WIO6SEMCR_SEMCID_Msk               (0x7UL << PWR_WIO6SEMCR_SEMCID_Pos)
#define PWR_WIO6SEMCR_SEMCID                   PWR_WIO6SEMCR_SEMCID_Msk  /*!< Semaphore Current Compartment IDWhen SEM_EN=1, this read-only bit field is updated with the CID value of the latest successfulacquisition of PWR_WIOxSEMCR semaphore (SEM_MUTEX bit set to 1). */

/* Bit fields for PWR_CPU1D1SR register */
#define PWR_CPU1D1SR_HOLD_BOOT_Pos             (0U)
#define PWR_CPU1D1SR_HOLD_BOOT_Msk             (0x1UL << PWR_CPU1D1SR_HOLD_BOOT_Pos)
#define PWR_CPU1D1SR_HOLD_BOOT                 PWR_CPU1D1SR_HOLD_BOOT_Msk  /*!< CPU1 HOLD_BOOT status flag.Set by hardware to indicate when the CPU1 is in HOLD_BOOT state.- 0: CPU1 is allowed to boot.- 1: CPU1 is maintained in HOLD_BOOT state by hardware.Refer to RCC specification for details on HOLD_BOOT processor state. */
#define PWR_CPU1D1SR_CSTATE_Pos                (2U)
#define PWR_CPU1D1SR_CSTATE_Msk                (0x3UL << PWR_CPU1D1SR_CSTATE_Pos)
#define PWR_CPU1D1SR_CSTATE                    PWR_CPU1D1SR_CSTATE_Msk  /*!< CPU1 cluster state status.Set by hardware to indicate when the CPU1 is in CRun, CSleep or CStop modes.- 00: CPU1 is in reset (Hold_boot or Wfben).- 01: CPU1 is in CRun state.- 10: CPU1 is in CSleep state.- 11: CPU1 is in CStop state. */
#define PWR_CPU1D1SR_DSTATE_Pos                (8U)
#define PWR_CPU1D1SR_DSTATE_Msk                (0x7UL << PWR_CPU1D1SR_DSTATE_Pos)
#define PWR_CPU1D1SR_DSTATE                    PWR_CPU1D1SR_DSTATE_Msk  /*!< D1 domain state status.Set by hardware to indicate when the D1 domain is in DRun, DStop1/2/3 or DStandby mode.- 000: DRun- 001: DStop1- 010: DStop2- 011: DStop3- 100: DStandby */

